{"backdropPath":"/kmEsQL2vOTA0jnM28fXS45Ky8kX.jpg","id":1241,"images":null,"translations":null,"name":"Harry Potter Collection","overview":"The Harry Potter films are a fantasy series based on the series of seven Harry Potter novels by British writer J. K. Rowling.","parts":[{"adult":false,"originalTitle":"Harry Potter and the Philosopher\u0027s Stone","releaseDate":"2001-11-16T00:00:00","title":"Harry Potter and the Philosopher\u0027s Stone","video":false,"backdropPath":"/bfh9Z3Ghz4FOJAfLOAhmc3ccnHU.jpg","genreIds":[12,14],"originalLanguage":"en","overview":"Harry Potter has lived under the stairs at his aunt and uncle\u0027s house his whole life. But on his 11th birthday, he learns he\u0027s a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school\u0027s kindly headmaster, Harry uncovers the truth about his parents\u0027 deaths—and about the villain who\u0027s to blame.","posterPath":"/wuMc08IPKEatf9rnMNXvIDxqP4W.jpg","voteAverage":7.902,"voteCount":28094,"id":671,"mediaType":1,"popularity":32.5775},{"adult":false,"originalTitle":"Harry Potter and the Chamber of Secrets","releaseDate":"2002-11-13T00:00:00","title":"Harry Potter and the Chamber of Secrets","video":false,"backdropPath":"/yHzyPJrVqlTySQ9mc379yxrLBYQ.jpg","genreIds":[12,14],"originalLanguage":"en","overview":"Cars fly, trees fight back, and a mysterious house-elf comes to warn Harry Potter at the start of his second year at Hogwarts. Adventure and danger await when bloody writing on a wall announces: The Chamber Of Secrets Has Been Opened. To save Hogwarts will require all of Harry, Ron and Hermione’s magical abilities and courage.","posterPath":"/sdEOH0992YZ0QSxgXNIGLq1ToUi.jpg","voteAverage":7.709,"voteCount":22441,"id":672,"mediaType":1,"popularity":24.2262},{"adult":false,"originalTitle":"Harry Potter and the Goblet of Fire","releaseDate":"2005-11-16T00:00:00","title":"Harry Potter and the Goblet of Fire","video":false,"backdropPath":"/5rrGVmRUuCKVbqUu41XIWTXJmNA.jpg","genreIds":[12,14],"originalLanguage":"en","overview":"When Harry Potter\u0027s name emerges from the Goblet of Fire, he becomes a competitor in a grueling battle for glory among three wizarding schools—the Triwizard Tournament. But since Harry never submitted his name for the Tournament, who did? Now Harry must confront a deadly dragon, fierce water demons and an enchanted maze only to find himself in the cruel grasp of He Who Must Not Be Named.","posterPath":"/fECBtHlr0RB3foNHDiCBXeg9Bv9.jpg","voteAverage":7.802,"voteCount":21099,"id":674,"mediaType":1,"popularity":21.5508},{"adult":false,"originalTitle":"Harry Potter and the Half-Blood Prince","releaseDate":"2009-07-15T00:00:00","title":"Harry Potter and the Half-Blood Prince","video":false,"backdropPath":"/urDWNffjwmNi5IQaezw9GwqkUXa.jpg","genreIds":[12,14],"originalLanguage":"en","overview":"As Lord Voldemort tightens his grip on both the Muggle and wizarding worlds, Hogwarts is no longer a safe haven. Harry suspects perils may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle fast approaching. Together they work to find the key to unlock Voldemorts defenses and to this end, Dumbledore recruits his old friend and colleague Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same again.","posterPath":"/z7uo9zmQdQwU5ZJHFpv2Upl30i1.jpg","voteAverage":7.684,"voteCount":19795,"id":767,"mediaType":1,"popularity":18.7183},{"adult":false,"originalTitle":"Harry Potter and the Prisoner of Azkaban","releaseDate":"2004-05-31T00:00:00","title":"Harry Potter and the Prisoner of Azkaban","video":false,"backdropPath":"/vbk5CfaAHOjQPSAcYm6AoRRz2Af.jpg","genreIds":[12,14],"originalLanguage":"en","overview":"Year three at Hogwarts means new fun and challenges as Harry learns the delicate art of approaching a Hippogriff, transforming shape-shifting Boggarts into hilarity and even turning back time. But the term also brings danger: soul-sucking Dementors hover over the school, an ally of the accursed He-Who-Cannot-Be-Named lurks within the castle walls, and fearsome wizard Sirius Black escapes Azkaban. And Harry will confront them all.","posterPath":"/aWxwnYoe8p2d2fcxOqtvAtJ72Rw.jpg","voteAverage":8.011,"voteCount":22024,"id":673,"mediaType":1,"popularity":21.6629},{"adult":false,"originalTitle":"Harry Potter and the Order of the Phoenix","releaseDate":"2007-07-08T00:00:00","title":"Harry Potter and the Order of the Phoenix","video":false,"backdropPath":"/82a7AGF081PzFfoM8GAVGMvZNYK.jpg","genreIds":[12,14],"originalLanguage":"en","overview":"Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students to defend themselves against the dark arts.","posterPath":"/5aOyriWkPec0zUDxmHFP9qMmBaj.jpg","voteAverage":7.674,"voteCount":19814,"id":675,"mediaType":1,"popularity":23.3731},{"adult":false,"originalTitle":"Harry Potter and the Deathly Hallows: Part 1","releaseDate":"2010-11-17T00:00:00","title":"Harry Potter and the Deathly Hallows: Part 1","video":false,"backdropPath":"/AqLcLsGGTzAjm3pCCq0CZCQrp6m.jpg","genreIds":[12,14],"originalLanguage":"en","overview":"Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort\u0027s bid for immortality. But with Harry\u0027s beloved Dumbledore dead and Voldemort\u0027s unscrupulous Death Eaters on the loose, the world is more dangerous than ever.","posterPath":"/iGoXIpQb7Pot00EEdwpwPajheZ5.jpg","voteAverage":7.742,"voteCount":19416,"id":12444,"mediaType":1,"popularity":18.2271},{"adult":false,"originalTitle":"Harry Potter and the Deathly Hallows: Part 2","releaseDate":"2011-07-12T00:00:00","title":"Harry Potter and the Deathly Hallows: Part 2","video":false,"backdropPath":"/n5A7brJCjejceZmHyujwUTVgQNC.jpg","genreIds":[14,12],"originalLanguage":"en","overview":"Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort\u0027s formidable skills.","posterPath":"/c54HpQmuwXjHq2C9wmoACjxoom3.jpg","voteAverage":8.087,"voteCount":20942,"id":12445,"mediaType":1,"popularity":18.1794}],"posterPath":"/s4hXqX1VyWMc2ctJRuNBDB7YNJ3.jpg"}